[
    {
        "questionId": 1,
        "steps": [
            {
                "title": "🔍 Passo 1 — Identificação do Problema",
                "content": "A questão pede para identificar a causa principal dos conflitos que levaram Chico Mendes a organizar os seringueiros, com base no texto de referência. É preciso encontrar o confronto central descrito na narrativa."
            },
            {
                "title": "💡 Passo 2 — Desenvolvimento",
                "content": "O texto afirma que Chico Mendes e seus companheiros lutavam para \"resistir ao avanço do desmatamento, que era impulsionado pela expansão da pecuária e pela extração predatória de madeira\". Em oposição a esse modelo, eles propunham as \"Reservas Extrativistas\" para a exploração sustentável. Isso mostra um choque direto entre dois modelos de uso da terra e dos recursos da floresta."
            },
            {
                "title": "🛠️ Passo 3 — Conclusão",
                "content": "O conflito central era, portanto, o embate entre a visão de desenvolvimento sustentável dos seringueiros e o modelo econômico predatório dos fazendeiros e madeireiros. Isso corresponde exatamente à alternativa que descreve \"o confronto entre o modelo de desenvolvimento extrativista sustentável e os interesses da expansão agropecuária predatória\"."
            }
        ]
    },
    {
        "questionId": 2,
        "steps": [
            {
                "title": "🔍 Passo 1 — Identificação do Problema",
                "content": "A pergunta exige a definição do termo 'empates' de acordo com o contexto apresentado no texto sobre a luta dos seringueiros na Amazônia."
            },
            {
                "title": "💡 Passo 2 — Desenvolvimento",
                "content": "O texto oferece uma definição clara e direta. Ele descreve os 'empates' como a \"principal tática de resistência utilizada por eles\", explicando que eram \"manifestações pacíficas em que os seringueiros se colocavam à frente das motosserras para impedir o corte das árvores\". A descrição enfatiza a natureza pacífica (não-violenta) e o objetivo de obstruir fisicamente o desmatamento."
            },
            {
                "title": "🛠️ Passo 3 — Conclusão",
                "content": "Dessa forma, o termo 'empates' se refere a uma tática de protesto não-violento com o objetivo específico de obstruir a derrubada da floresta, o que confirma a alternativa correta."
            }
        ]
    },
    {
        "questionId": 3,
        "steps": [
            {
                "title": "🔍 Passo 1 — Identificação do Problema",
                "content": "A questão pede para classificar o modelo das 'Reservas Extrativistas', defendido por Chico Mendes, com base na sua descrição fornecida pelo texto."
            },
            {
                "title": "💡 Passo 2 — Desenvolvimento",
                "content": "O texto explica que as Reservas Extrativistas são áreas onde \"os recursos naturais, como a castanha e o látex, poderiam ser explorados de forma sustentável pelas populações tradicionais, garantindo tanto a sua subsistência quanto a conservação do ecossistema\". A ideia de conciliar a exploração de recursos para o sustento humano com a preservação do meio ambiente é a definição central do conceito de desenvolvimento sustentável."
            },
            {
                "title": "🛠️ Passo 3 — Conclusão",
                "content": "Portanto, o modelo das Reservas Extrativistas é um exemplo prático de desenvolvimento sustentável, pois une a atividade econômica das comunidades locais com a conservação ambiental."
            }
        ]
    },
    {
        "questionId": 4,
        "steps": [
            {
                "title": "🔍 Passo 1 — Identificação do Problema",
                "content": "A pergunta busca a afirmação que melhor descreve as causas da Revolta da Vacina, utilizando as informações do texto de referência."
            },
            {
                "title": "💡 Passo 2 — Desenvolvimento",
                "content": "O texto aponta que a obrigatoriedade da vacina foi o \"estopim\" (gatilho), mas não a única causa. Ele deixa claro que a população já estava \"insatisfeita com as demolições autoritárias da reforma urbana (o famoso 'Bota-Abaixo')\" e desconfiava do \"autoritarismo do Estado\". O próprio texto conclui que a revolta \"não foi apenas uma recusa à imunização, mas a expressão de uma insatisfação popular mais ampla\"."
            },
            {
                "title": "🛠️ Passo 3 — Conclusão",
                "content": "Conclui-se que a Revolta da Vacina foi um movimento complexo, motivado por um conjunto de fatores: a oposição à vacinação obrigatória, a insatisfação com a reforma urbana autoritária e a exclusão social. A alternativa correta é a que engloba todos esses elementos."
            }
        ]
    },
    {
        "questionId": 5,
        "steps": [
            {
                "title": "🔍 Passo 1 — Identificação do Problema",
                "content": "A questão pede para interpretar o significado da palavra 'estopim' dentro do contexto histórico da Revolta da Vacina, como usada no texto."
            },
            {
                "title": "💡 Passo 2 — Desenvolvimento",
                "content": "O texto descreve um cenário de crescente insatisfação popular devido à reforma urbana e aos métodos sanitários autoritários. Em seguida, introduz a lei da vacinação obrigatória com a frase: \"O estopim para a revolta popular, contudo, foi...\". Em sentido figurado, 'estopim' é o gatilho, a faísca que acende um material já inflamável. Nesse caso, a 'pólvora' era a insatisfação geral, e a lei foi a faísca que iniciou a 'explosão' (a revolta)."
            },
            {
                "title": "🛠️ Passo 3 — Conclusão",
                "content": "Portanto, a palavra 'estopim' refere-se ao evento específico (a lei da vacinação obrigatória) que serviu como gatilho imediato para deflagrar a revolta popular que já estava latente."
            }
        ]
    },
    {
        "questionId": 6,
        "steps": [
            {
                "title": "🔍 Passo 1 — Identificação do Problema",
                "content": "A pergunta foca no princípio biológico da vacinação, questionando por que a campanha contra a varíola, citada no texto, era uma medida de saúde pública tão importante."
            },
            {
                "title": "💡 Passo 2 — Desenvolvimento",
                "content": "A vacinação funciona introduzindo no corpo um agente infeccioso (vírus, no caso da varíola) em uma forma inofensiva (morto ou atenuado). Isso 'ensina' o sistema imunológico a reconhecer e combater esse invasor específico. O corpo, então, produz células de defesa (anticorpos) e células de memória. Caso a pessoa seja infectada pelo vírus ativo no futuro, seu sistema imunológico já terá uma defesa pronta e rápida, impedindo o desenvolvimento da doença."
            },
            {
                "title": "🛠️ Passo 3 — Conclusão",
                "content": "Conclui-se que a importância da vacina reside em sua capacidade de estimular o sistema imunológico a criar uma memória de defesa (imunização ativa e duradoura) contra o vírus, prevenindo infecções futuras e controlando a disseminação da doença na população."
            }
        ]
    }
]