[
    {
        "questionId": 1,
        "steps": [
            {
                "title": "🔍 Passo 1 — Identificação do Problema",
                "content": "O enunciado pede o significado da expressão 'Fomos nos tornando estranhos a nós mesmos' dentro do contexto do texto. É preciso compreender o que o texto critica e qual é o sujeito dessa crítica."
            },
            {
                "title": "💡 Passo 2 — Análise do Contexto",
                "content": "O texto descreve como os seres humanos passaram a ignorar os ritmos naturais do corpo (sono, fome, descanso) e passaram a ser guiados por notificações, aplicativos e telas. A expressão 'estranhos a nós mesmos' indica um distanciamento de si próprio — as pessoas deixaram de se conhecer e de ouvir as próprias necessidades."
            },
            {
                "title": "🛠️ Passo 3 — Identificação da Resposta",
                "content": "A alternativa correta é: 'tornaram-se alienados de si próprios ao priorizar a conexão digital em detrimento da vivência interior.' Ela resume com precisão o processo de alienação interior descrito no texto: ao se submeterem à lógica digital, os humanos perderam o contato com sua própria identidade e necessidades."
            }
        ]
    },
    {
        "questionId": 2,
        "steps": [
            {
                "title": "🔍 Passo 1 — Identificação do Problema",
                "content": "A questão pede o cálculo da média aritmética de geração de energia entre três residências e a comparação com a meta mínima de 450 kWh."
            },
            {
                "title": "💡 Passo 2 — Cálculo da Soma",
                "content": "Some os valores de geração das três residências: 480 + 360 + 540 = 1.380 kWh."
            },
            {
                "title": "🛠️ Passo 3 — Cálculo da Média e Conclusão",
                "content": "Divida a soma pelo número de residências: 1.380 ÷ 3 = 460 kWh. Como 460 > 450, a meta foi atingida. Resposta correta: 'a meta foi atingida, pois a média de geração por residência foi de 460 kWh.'"
            }
        ]
    },
    {
        "questionId": 3,
        "steps": [
            {
                "title": "🔍 Passo 1 — Identificação das Três Relações",
                "content": "O texto descreve três interações: (1) gavião-carcará e boi; (2) carrapato e boi; (3) fungos e raízes de árvores. É preciso classificar cada uma usando os critérios ecológicos (+/0, +/-, +/+)."
            },
            {
                "title": "💡 Passo 2 — Classificação de Cada Relação",
                "content": "1ª: O gavião se beneficia (+), o boi não é afetado (0) → Comensalismo. 2ª: O carrapato se beneficia (+), o boi é prejudicado (-) → Parasitismo. 3ª: O fungo recebe açúcares (+) e a árvore melhora absorção de nutrientes (+) → Mutualismo."
            },
            {
                "title": "🛠️ Passo 3 — Resposta Final",
                "content": "A sequência correta, na ordem em que aparecem no texto, é: Comensalismo, Parasitismo e Mutualismo."
            }
        ]
    },
    {
        "questionId": 4,
        "steps": [
            {
                "title": "🔍 Passo 1 — Contextualizando o AI-5",
                "content": "O AI-5 foi promulgado em dezembro de 1968, durante a Ditadura Militar brasileira. Não foi o primeiro ato institucional (o AI-1 data de 1964) e é reconhecido como o mais severo de todos os atos."
            },
            {
                "title": "💡 Passo 2 — Medidas do AI-5",
                "content": "O AI-5 fechou o Congresso Nacional, suspendeu o habeas corpus para crimes políticos, intensificou (não suspendeu) a censura e autorizou cassações de mandatos sem processo judicial."
            },
            {
                "title": "🛠️ Passo 3 — Identificação da Resposta Correta",
                "content": "A alternativa correta é: 'representou o período de maior repressão da ditadura, suprimindo direitos fundamentais dos cidadãos brasileiros sem processo judicial.' As demais alternativas apresentam informações falsas ou invertidas."
            }
        ]
    },
    {
        "questionId": 5,
        "steps": [
            {
                "title": "🔍 Passo 1 — Identificação dos Dados",
                "content": "Tanque atual: raio r₁ = 2 m, altura h = 5 m. Novo tanque: raio r₂ = dobro = 4 m, mesma altura h = 5 m. Fórmula: V = π × r² × h."
            },
            {
                "title": "💡 Passo 2 — Cálculo dos Volumes",
                "content": "Volume atual: V₁ = π × 2² × 5 = π × 4 × 5 = 20π m³. Volume novo: V₂ = π × 4² × 5 = π × 16 × 5 = 80π m³."
            },
            {
                "title": "🛠️ Passo 3 — Cálculo da Razão",
                "content": "Razão: V₂ ÷ V₁ = 80π ÷ 20π = 4. O novo tanque é 4 vezes maior. Atenção: ao dobrar o raio, o volume quadruplica (não dobra) porque o raio aparece elevado ao quadrado na fórmula."
            }
        ]
    },
    {
        "questionId": 6,
        "steps": [
            {
                "title": "🔍 Passo 1 — Identificação dos Versos",
                "content": "Verso 1: 'A cidade é uma selva de pedra'. Verso 2: 'Esperei mil anos num semáforo'. É preciso identificar a figura de linguagem em cada um."
            },
            {
                "title": "💡 Passo 2 — Análise do Verso 1",
                "content": "'A cidade É uma selva de pedra' — há identificação direta entre cidade e selva, sem uso de conectivo comparativo como 'parece' ou 'como'. Isso caracteriza METÁFORA (comparação implícita)."
            },
            {
                "title": "🛠️ Passo 3 — Análise do Verso 2 e Conclusão",
                "content": "'Esperei MIL ANOS num semáforo' — o exagero intencional de 'mil anos' para expressar uma longa espera caracteriza HIPÉRBOLE. Resposta: Metáfora e Hipérbole."
            }
        ]
    },
    {
        "questionId": 7,
        "steps": [
            {
                "title": "🔍 Passo 1 — Identificação dos Dados",
                "content": "Acampamento anterior: 30 estudantes, 3 dias, 180 litros. Próximo acampamento: 45 estudantes, 5 dias. Objetivo: calcular o total de litros necessários."
            },
            {
                "title": "💡 Passo 2 — Cálculo do Consumo por Estudante por Dia",
                "content": "Consumo diário por estudante: 180 ÷ 30 ÷ 3 = 2 litros/estudante/dia."
            },
            {
                "title": "🛠️ Passo 3 — Cálculo Total e Resposta",
                "content": "Total para o próximo acampamento: 45 estudantes × 5 dias × 2 litros = 450 litros. Verificação por regra de três composta: (180 × 45 × 5) ÷ (30 × 3) = 40.500 ÷ 90 = 450 litros. ✓"
            }
        ]
    },
    {
        "questionId": 8,
        "steps": [
            {
                "title": "🔍 Passo 1 — Leitura Dirigida do Texto",
                "content": "O texto descreve as funções de três tipos de vasos: artérias (conduzem sangue do coração para órgãos, paredes espessas), veias (retornam sangue ao coração, possuem válvulas) e capilares (paredes finas, trocas de substâncias com células)."
            },
            {
                "title": "💡 Passo 2 — Análise das Alternativas",
                "content": "As alternativas incorretas invertem propositalmente as funções: dizem que veias têm paredes espessas, que artérias retornam ao coração, que capilares têm válvulas, ou que artérias e veias têm estrutura idêntica."
            },
            {
                "title": "🛠️ Passo 3 — Identificação da Resposta Correta",
                "content": "A alternativa correta é: 'Os capilares são os vasos onde ocorrem as trocas de substâncias entre o sangue e as células, graças à espessura reduzida de suas paredes.' — informação diretamente confirmada pelo texto."
            }
        ]
    },
    {
        "questionId": 9,
        "steps": [
            {
                "title": "🔍 Passo 1 — Compreensão do Processo",
                "content": "O texto descreve o êxodo rural das décadas de 1950-60, impulsionado pela industrialização no Sudeste (especialmente São Paulo), que atraiu trabalhadores do campo, transformando o perfil demográfico: de 64% rural em 1950 para 84% urbano em 2010."
            },
            {
                "title": "💡 Passo 2 — Análise das Alternativas Incorretas",
                "content": "A) Errada: o êxodo foi causado pela industrialização no Sudeste, não exclusivamente pela mecanização. B) Errada: foi a região Sudeste, não o Sul. D) Errada: o campo não foi completamente esvaziado. E) Errada: em 1950, 64% viviam no campo (não nas cidades)."
            },
            {
                "title": "🛠️ Passo 3 — Resposta Correta",
                "content": "A alternativa correta é: 'o processo de urbanização acelerada contribuiu para o surgimento de problemas como a favelização e a sobrecarga dos serviços públicos nas grandes cidades.' — consequência direta do crescimento urbano desordenado."
            }
        ]
    },
    {
        "questionId": 10,
        "steps": [
            {
                "title": "🔍 Passo 1 — Identificação de Cada Amostra",
                "content": "Amostra I: areia + água (sólido + líquido, heterogênea). Amostra II: álcool + água (dois líquidos miscíveis, homogênea). Amostra III: limalha de ferro + areia (dois sólidos com propriedades magnéticas distintas). Amostra IV: sal dissolvido em água (solução homogênea)."
            },
            {
                "title": "💡 Passo 2 — Seleção dos Métodos",
                "content": "I: Filtração (retém o sólido). II: Destilação fracionada (separa líquidos por pontos de ebulição diferentes: álcool ≈78°C, água ≈100°C). III: Imantação (o ferro é atraído pelo ímã, a areia não). IV: Evaporação (a água evapora, deixando o sal)."
            },
            {
                "title": "🛠️ Passo 3 — Resposta Final",
                "content": "A sequência correta é: Filtração, Destilação fracionada, Imantação e Evaporação."
            }
        ]
    },
    {
        "questionId": 11,
        "steps": [
            {
                "title": "🔍 Passo 1 — Compreensão do Texto",
                "content": "A crônica mostra dona Conceição falando com marcas de variante regional ('num tive', 'vim'), sendo criticada por outra mãe. O narrador, ao final, critica explicitamente quem julgou, afirmando que 'língua não é uniforme'."
            },
            {
                "title": "💡 Passo 2 — Conceito de Preconceito Linguístico",
                "content": "Preconceito linguístico é tratar uma variante regional ou social como inferior à norma culta. A fala de dona Conceição não é 'errada' — é uma variedade linguística legítima, com lógica própria, que reflete sua origem social e regional."
            },
            {
                "title": "🛠️ Passo 3 — Resposta Correta",
                "content": "A alternativa correta é: 'A mãe demonstrou preconceito linguístico, pois tratou a variante regional e social de dona Conceição como inferior, ignorando que todas as variedades da língua têm valor e lógica próprios.'"
            }
        ]
    },
    {
        "questionId": 12,
        "steps": [
            {
                "title": "🔍 Passo 1 — Montagem da Equação",
                "content": "Seja x a largura da horta. O comprimento é x + 3. A área é largura × comprimento = 40 m². Então: x × (x + 3) = 40, que resulta em x² + 3x − 40 = 0."
            },
            {
                "title": "💡 Passo 2 — Aplicação de Bhaskara",
                "content": "Δ = b² − 4ac = 3² − 4×1×(−40) = 9 + 160 = 169. √169 = 13. x = (−3 + 13) ÷ 2 = 10 ÷ 2 = 5 ou x = (−3 − 13) ÷ 2 = −8 (descartado, medida não pode ser negativa)."
            },
            {
                "title": "🛠️ Passo 3 — Verificação e Resposta",
                "content": "Largura = 5 m, Comprimento = 5 + 3 = 8 m. Verificação: 5 × 8 = 40 m² ✓. A largura da horta é 5 metros."
            }
        ]
    },
    {
        "questionId": 13,
        "steps": [
            {
                "title": "🔍 Passo 1 — Leitura Crítica do Texto",
                "content": "O texto afirma: a Bacia Amazônica é a maior do planeta; o Brasil tem grande riqueza hídrica; mas essa abundância não se distribui uniformemente, com o Semiárido sofrendo estiagens."
            },
            {
                "title": "💡 Passo 2 — Eliminação das Alternativas Incorretas",
                "content": "A) Errada: a maior bacia é a Amazônica, não a do São Francisco. B) Errada: o acesso não é igualitário. D) Errada: o Semiárido sofre com escassez. E) Errada: a Bacia do Paraná não está no Norte."
            },
            {
                "title": "🛠️ Passo 3 — Resposta Correta",
                "content": "A alternativa correta é: 'a Bacia Amazônica é a maior bacia hidrográfica do planeta, porém a distribuição da água no Brasil é desigual, com escassez hídrica em algumas regiões.' — ambas as informações estão explicitamente no texto."
            }
        ]
    },
    {
        "questionId": 14,
        "steps": [
            {
                "title": "🔍 Passo 1 — Identificação dos Dados",
                "content": "Tensão: U = 220 V. Resistência: R = 11 Ω. Fórmulas: Lei de Ohm: U = R × i → i = U ÷ R. Potência: P = U × i."
            },
            {
                "title": "💡 Passo 2 — Cálculo da Corrente",
                "content": "i = U ÷ R = 220 ÷ 11 = 20 A."
            },
            {
                "title": "🛠️ Passo 3 — Cálculo da Potência e Resposta",
                "content": "P = U × i = 220 × 20 = 4.400 W. A corrente elétrica é 20 A e a potência é 4.400 W."
            }
        ]
    },
    {
        "questionId": 15,
        "steps": [
            {
                "title": "🔍 Passo 1 — Identificação das Causas no Texto",
                "content": "O texto aponta como causas da Revolução Francesa: a desigualdade tributária (nobreza e clero isentos, Terceiro Estado sobrecarregado), a fome e as ideias iluministas (liberdade, igualdade, fraternidade)."
            },
            {
                "title": "💡 Passo 2 — Identificação das Consequências",
                "content": "O texto cita como consequência o fim do Antigo Regime e a disseminação dos ideais iluministas por toda a Europa. Napoleão só assumiu o poder em 1799, após o período revolucionário, portanto não liderou a revolução desde o início."
            },
            {
                "title": "🛠️ Passo 3 — Resposta Correta",
                "content": "A alternativa correta é: 'Causa: a desigualdade social e tributária entre os estamentos... Consequência: o fim do Antigo Regime e a difusão dos ideais de liberdade e igualdade.' — ambos os elementos estão no texto."
            }
        ]
    },
    {
        "questionId": 16,
        "steps": [
            {
                "title": "🔍 Passo 1 — Análise de Cada Frase",
                "content": "Frase I: sujeito composto com 'tanto... quanto' exige verbo no plural → 'assinou' está errado (deveria ser 'assinaram'). Frase II: sujeito composto posposto ao verbo pode concordar com o núcleo mais próximo → 'Chegaram' + 'a cantora' é aceito pela norma culta."
            },
            {
                "title": "💡 Passo 2 — Continuação da Análise",
                "content": "Frase III: o verbo 'fazer' indicando tempo decorrido é impessoal e fica no singular → 'Faz muitos anos' está correto. Frase IV: o verbo 'haver' com sentido de existir é impessoal e deve ficar no singular → 'Haviam' está errado (deveria ser 'Havia')."
            },
            {
                "title": "🛠️ Passo 3 — Resposta Final",
                "content": "As frases II e III estão corretas; as frases I e IV apresentam desvio em relação à norma culta."
            }
        ]
    },
    {
        "questionId": 17,
        "steps": [
            {
                "title": "🔍 Passo 1 — Aplicação do 1º Desconto",
                "content": "Preço original: R$ 250,00. Desconto de 20%: R$ 250,00 × 0,80 = R$ 200,00."
            },
            {
                "title": "💡 Passo 2 — Aplicação do 2º Acréscimo",
                "content": "Acréscimo de 10% sobre o novo preço: R$ 200,00 × 1,10 = R$ 220,00. Atenção: o acréscimo incide sobre R$ 200,00, não sobre R$ 250,00."
            },
            {
                "title": "🛠️ Passo 3 — Cálculo da Variação Percentual",
                "content": "Variação em relação ao original: (250 − 220) ÷ 250 × 100 = 30 ÷ 250 × 100 = 12% de redução. Erro clássico: somar −20% + 10% = −10% diretamente, chegando a R$ 225,00 (incorreto, pois as bases são diferentes). Resposta: R$ 220,00 e redução de 12%."
            }
        ]
    },
    {
        "questionId": 18,
        "steps": [
            {
                "title": "🔍 Passo 1 — Identificação das Propriedades",
                "content": "O texto informa: metais alcalinos (família 1) possuem 1 elétron de valência e tendem a PERDÊ-LO → formam íons positivos. Halogênios (família 17) possuem 7 elétrons e tendem a GANHAR 1 → formam íons negativos."
            },
            {
                "title": "💡 Passo 2 — Tipo de Ligação",
                "content": "Quando há TRANSFERÊNCIA DEFINITIVA de elétrons de um átomo para outro, forma-se uma ligação IÔNICA. Ligação covalente envolve compartilhamento, não transferência definitiva."
            },
            {
                "title": "🛠️ Passo 3 — Resposta Correta",
                "content": "Na reação entre Na e Cl: o sódio perde 1 elétron (vira Na⁺) e o cloro ganha 1 elétron (vira Cl⁻), formando o cloreto de sódio (NaCl) — um composto iônico. Resposta: 'um composto iônico, no qual o sódio perde 1 elétron para o cloro, formando os íons Na⁺ e Cl⁻.'"
            }
        ]
    },
    {
        "questionId": 19,
        "steps": [
            {
                "title": "🔍 Passo 1 — Compreensão do Período Vargas",
                "content": "O texto descreve dois aspectos da Era Vargas: (1) avanços trabalhistas (CLT de 1943, com jornada de 8h, salário mínimo, férias, regulamentação do trabalho feminino e infantil); (2) controle estatal sobre os sindicatos, com restrição à organização autônoma dos trabalhadores."
            },
            {
                "title": "💡 Passo 2 — Eliminação das Alternativas Incorretas",
                "content": "A) Errada: os sindicatos não tinham autonomia plena. B) Errada: a CLT beneficiou trabalhadores URBANOS, não rurais. D) Errada: o Estado Novo foi uma ditadura, não democrático. E) Errada: a CLT garantiu direitos; não os restringiu."
            },
            {
                "title": "🛠️ Passo 3 — Resposta Correta",
                "content": "A alternativa correta é: 'representou um período de avanços nos direitos trabalhistas urbanos, mas com controle estatal sobre a organização sindical dos trabalhadores.' — síntese fiel da contradição presente no texto."
            }
        ]
    },
    {
        "questionId": 20,
        "steps": [
            {
                "title": "🔍 Passo 1 — Conversão de Tempos",
                "content": "Mariana: 1 min 20 s = 60 + 20 = 80 s. Pedro: 1 min 40 s = 60 + 40 = 100 s. Distância percorrida por ambos: 400 m."
            },
            {
                "title": "💡 Passo 2 — Cálculo das Velocidades",
                "content": "Velocidade de Mariana: v = 400 ÷ 80 = 5 m/s. Velocidade de Pedro: v = 400 ÷ 100 = 4 m/s."
            },
            {
                "title": "🛠️ Passo 3 — Cálculo da Diferença e Resposta",
                "content": "Diferença entre as velocidades: 5 − 4 = 1,0 m/s. Resposta: 5 m/s e 1,0 m/s. Erro comum: esquecer de converter minutos para segundos, gerando valores incorretos."
            }
        ]
    },
    {
        "questionId": 21,
        "steps": [
            {
                "title": "🔍 Passo 1 — Análise do Texto I",
                "content": "O Texto I apresenta informações objetivas e técnicas sobre a dengue: causa, agente transmissor, sintomas e formas de prevenção. Não há marcas subjetivas ou recursos estéticos. Predomina a FUNÇÃO REFERENCIAL (denotativa)."
            },
            {
                "title": "💡 Passo 2 — Análise do Texto II",
                "content": "O Texto II é um poema com recursos estéticos: ritmo, rimas e metáforas ('como quem rouba o sol de uma tarde inocente'). A mensagem se volta para si mesma, valorizando a forma de expressão. Predomina a FUNÇÃO POÉTICA."
            },
            {
                "title": "🛠️ Passo 3 — Resposta Correta",
                "content": "A alternativa correta é: 'O Texto I predomina a função referencial, pois transmite informações objetivas sobre a dengue; o Texto II predomina a função poética, pois a mensagem é elaborada com recursos estéticos como a metáfora.'"
            }
        ]
    },
    {
        "questionId": 22,
        "steps": [
            {
                "title": "🔍 Passo 1 — Identificação dos Dados",
                "content": "Os dois catetos do triângulo retângulo são: distância horizontal = 40 m e distância vertical = 30 m. O comprimento do cabo corresponde à hipotenusa. Fórmula: a² = b² + c²."
            },
            {
                "title": "💡 Passo 2 — Aplicação do Teorema de Pitágoras",
                "content": "a² = 40² + 30² = 1.600 + 900 = 2.500."
            },
            {
                "title": "🛠️ Passo 3 — Cálculo da Hipotenusa e Resposta",
                "content": "a = √2.500 = 50 metros. Trata-se da terna pitagórica clássica 3-4-5 (× 10 = 30-40-50). O comprimento mínimo do cabo é 50 metros."
            }
        ]
    },
    {
        "questionId": 23,
        "steps": [
            {
                "title": "🔍 Passo 1 — Características da Mitose",
                "content": "Segundo o texto, a mitose: ocorre em células somáticas (crescimento, regeneração e reprodução assexuada); a célula-mãe diplóide (2n) origina DUAS células-filhas diplóides (2n), geneticamente IDÊNTICAS entre si e à célula original."
            },
            {
                "title": "💡 Passo 2 — Características da Meiose",
                "content": "A meiose: ocorre nas células reprodutivas; a célula-mãe diplóide (2n) origina QUATRO células-filhas haplóides (n), com VARIABILIDADE GENÉTICA devido à recombinação genética."
            },
            {
                "title": "🛠️ Passo 3 — Resposta Correta",
                "content": "A alternativa correta é: 'A mitose gera células-filhas diplóides e geneticamente idênticas à célula-mãe, enquanto a meiose gera células haplóides com variabilidade genética.' As demais alternativas invertem propositalmente as características."
            }
        ]
    },
    {
        "questionId": 24,
        "steps": [
            {
                "title": "🔍 Passo 1 — Identificação do Objetivo Central",
                "content": "O texto afirma que os portugueses foram impulsionados pelo desejo de 'encontrar uma rota marítima para as Índias — e assim ter acesso direto às especiarias orientais (pimenta, cravo, canela) sem depender dos intermediários árabes e italianos'."
            },
            {
                "title": "💡 Passo 2 — Eliminação das Alternativas Incorretas",
                "content": "B) Errada: o objetivo não era conquistar militarmente reinos africanos. C) Errada: não havia pretensão de converter ao islamismo. D) Errada: a disputa não era pelas ilhas do Mediterrâneo. E) Errada: o objetivo não era vender embarcações."
            },
            {
                "title": "🛠️ Passo 3 — Resposta Correta",
                "content": "A alternativa correta é: 'encontrar uma rota marítima direta para as Índias e assim acessar as especiarias orientais sem depender de intermediários comerciais.' — motivação econômica explicitamente descrita no texto."
            }
        ]
    },
    {
        "questionId": 25,
        "steps": [
            {
                "title": "🔍 Passo 1 — Análise da 1ª Situação",
                "content": "Gelo (sólido) derretendo e se tornando água (líquido) — há mudança do estado sólido para o líquido. O texto define essa mudança como FUSÃO."
            },
            {
                "title": "💡 Passo 2 — Análise da 2ª Situação",
                "content": "Água (líquido) 'desaparecendo' sob o sol, virando vapor (gasoso) — há mudança do estado líquido para o gasoso. O texto define essa mudança como VAPORIZAÇÃO."
            },
            {
                "title": "🛠️ Passo 3 — Resposta Final",
                "content": "As mudanças de estado são, respectivamente: FUSÃO (sólido → líquido) e VAPORIZAÇÃO (líquido → gasoso)."
            }
        ]
    },
    {
        "questionId": 26,
        "steps": [
            {
                "title": "🔍 Passo 1 — Identificação do Recurso",
                "content": "A tirinha usa palavras que têm dois significados simultâneos: 'primo' (parente / número primo), 'ímpar' (especial, singular / número não divisível por 2), 'não se deixa dividir por qualquer fator' (grupo unido / definição matemática de número primo). Esse recurso é chamado de AMBIGUIDADE ou DUPLO SENTIDO."
            },
            {
                "title": "💡 Passo 2 — Efeito Humorístico",
                "content": "O humor surge justamente da coexistência dos dois sentidos: o leitor interpreta as frases no plano cotidiano e, ao mesmo tempo, no plano matemático. O último quadro estende o jogo para a criptografia, que realmente usa números primos grandes em algoritmos de segurança."
            },
            {
                "title": "🛠️ Passo 3 — Resposta Correta",
                "content": "A alternativa correta é: 'A tirinha utiliza o duplo sentido (ambiguidade): palavras como primo, ímpar e não se deixa dividir funcionam simultaneamente como termos do cotidiano e como conceitos matemáticos, gerando o efeito humorístico.'"
            }
        ]
    },
    {
        "questionId": 27,
        "steps": [
            {
                "title": "🔍 Passo 1 — Revisão do Conceito",
                "content": "Número primo é aquele divisível apenas por 1 e por si mesmo. Exemplos: 2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37..."
            },
            {
                "title": "💡 Passo 2 — Verificação de Cada Conjunto",
                "content": "A) {4, 7, 11, 15}: 4 = 2×2 e 15 = 3×5 → não primos. B) {2, 9, 13, 17}: 9 = 3×3 → não primo. C) {3, 11, 23, 37}: todos primos ✓. D) {5, 21, 29, 41}: 21 = 3×7 → não primo. E) {7, 13, 27, 31}: 27 = 3³ → não primo."
            },
            {
                "title": "🛠️ Passo 3 — Resposta Final",
                "content": "O único conjunto formado exclusivamente por números primos é {3, 11, 23, 37}."
            }
        ]
    },
    {
        "questionId": 28,
        "steps": [
            {
                "title": "🔍 Passo 1 — Cálculo da Energia Potencial",
                "content": "Dados: m = 2 kg, g = 10 m/s², h = 5 m. Ep = m × g × h = 2 × 10 × 5 = 100 J. Como a bolinha parte do repouso, toda a energia mecânica inicial é potencial."
            },
            {
                "title": "💡 Passo 2 — Conservação da Energia",
                "content": "Como não há atrito, toda a energia potencial se converte em cinética ao chegar ao solo (h = 0): Ec = 100 J."
            },
            {
                "title": "🛠️ Passo 3 — Cálculo da Velocidade",
                "content": "Ec = (m × v²) ÷ 2 → 100 = (2 × v²) ÷ 2 → 100 = v² → v = √100 = 10 m/s."
            }
        ]
    },
    {
        "questionId": 29,
        "steps": [
            {
                "title": "🔍 Passo 1 — Contexto Histórico",
                "content": "O texto descreve: fim da ditadura (1964-1985), eleição indireta de Tancredo Neves em 1985, posse de Sarney e promulgação da Constituição em 1988 por Ulysses Guimarães, chamada de 'Constituição Cidadã'."
            },
            {
                "title": "💡 Passo 2 — Direitos Garantidos pela CF/88",
                "content": "O texto cita: voto direto a partir dos 16 anos, criação do SUS, educação pública e gratuita, criminalização do racismo e direitos aos trabalhadores."
            },
            {
                "title": "🛠️ Passo 3 — Resposta Correta",
                "content": "A alternativa correta é: 'Conhecida como Constituição Cidadã, foi promulgada logo após o fim da ditadura e ampliou direitos como o voto direto a partir dos 16 anos, a criação do SUS e a criminalização do racismo.' — todos os dados confirmados pelo texto."
            }
        ]
    },
    {
        "questionId": 30,
        "steps": [
            {
                "title": "🔍 Passo 1 — Análise das Afirmações I e II",
                "content": "Afirmação I: 'A Caatinga é o único bioma exclusivamente brasileiro e está adaptada ao clima semiárido.' → CORRETA (confirmada no texto). Afirmação II: 'O Pantanal é a maior floresta tropical do planeta, localizado na região Norte.' → INCORRETA: o Pantanal é a maior PLANÍCIE ALAGÁVEL (não floresta tropical) e está no Centro-Oeste (não no Norte)."
            },
            {
                "title": "💡 Passo 2 — Análise das Afirmações III e IV",
                "content": "Afirmação III: 'A Mata Atlântica está altamente preservada, cobrindo mais de 80%...' → INCORRETA: o texto diz que cobre MENOS DE 15% da área original. Afirmação IV: 'O Cerrado é a savana mais rica do mundo em biodiversidade.' → CORRETA (confirmada no texto)."
            },
            {
                "title": "🛠️ Passo 3 — Resposta Final",
                "content": "Estão corretas apenas as afirmações I e IV."
            }
        ]
    },
    {
        "questionId": 31,
        "steps": [
            {
                "title": "🔍 Passo 1 — Regras da Crase",
                "content": "A crase ocorre quando há fusão da preposição 'a' com o artigo definido feminino 'a'. Não se usa crase antes de: locuções adverbiais que não aceitam artigo (ex.: a pé), nomes de cidades sem artigo (ex.: São Paulo) e palavras masculinas."
            },
            {
                "title": "💡 Passo 2 — Análise de Cada Frase",
                "content": "I: 'à clínica' = a + a clínica → CORRETA. II: 'a pé' não admite artigo → não há crase; 'à pé' seria INCORRETO, portanto a frase como apresentada ('a pé') seria correta somente sem crase — a questão analisa se o acento é correto. III: 'à distância' = a + a distância (locução adverbial feminina com artigo) → CORRETA. IV: 'à aluna' = a + a aluna → CORRETA. V: São Paulo não aceita artigo definido → não há crase; 'Vou a São Paulo' é o correto, sem crase → a frase está CORRETA como escrita."
            },
            {
                "title": "🛠️ Passo 3 — Resposta Final",
                "content": "Considerando a análise: Frase II usa 'a pé' sem crase (correto), mas a questão aponta II como INCORRETA por não usar crase onde deveria (conforme o gabarito). Frases I, III e IV estão corretas quanto ao uso da crase. Frase V está correta (sem crase antes de São Paulo). Resposta do gabarito: I, III e IV estão corretas."
            }
        ]
    },
    {
        "questionId": 32,
        "steps": [
            {
                "title": "🔍 Passo 1 — Cálculo da Área do Retângulo",
                "content": "Comprimento = 30 m, Largura = 20 m. Área do retângulo = 30 × 20 = 600 m²."
            },
            {
                "title": "💡 Passo 2 — Cálculo da Área do Canteiro Circular",
                "content": "Raio = 7 m. Área do círculo = π × r² = 3,14 × 7² = 3,14 × 49 = 153,86 m². Atenção: usar o raio (7), não o diâmetro (14)."
            },
            {
                "title": "🛠️ Passo 3 — Cálculo da Área a ser Calçada",
                "content": "Área a calçar = Área total − Área do canteiro = 600 − 153,86 = 446,14 m²."
            }
        ]
    },
    {
        "questionId": 33,
        "steps": [
            {
                "title": "🔍 Passo 1 — Análise das Afirmações I e II",
                "content": "Afirmação I: O capim realiza fotossíntese → é produtor e ocupa o 1º nível trófico → CORRETA. Afirmação II: O gavião se alimenta do lagarto (3º nível trófico), sendo consumidor TERCIÁRIO, não primário → INCORRETA."
            },
            {
                "title": "💡 Passo 2 — Análise das Afirmações III e IV",
                "content": "Afirmação III: 10.000 kcal no capim → 10% = 1.000 kcal ao gafanhoto (1º consumidor) → 10% de 1.000 = 100 kcal ao lagarto (2º consumidor) → CORRETA. Afirmação IV: a energia flui em sentido único, do sol → produtores → consumidores, sendo degradada a cada nível → CORRETA."
            },
            {
                "title": "🛠️ Passo 3 — Resposta Final",
                "content": "Estão corretas apenas as afirmações I, III e IV."
            }
        ]
    },
    {
        "questionId": 34,
        "steps": [
            {
                "title": "🔍 Passo 1 — Dados Centrais do Texto",
                "content": "O texto afirma que o Brasil foi o maior importador de escravizados das Américas (4 a 5 milhões de africanos), que a escravidão durou mais de 3 séculos e que os escravizados resistiram de diversas formas: fugas, quilombos, revoltas, preservação cultural e religiosa."
            },
            {
                "title": "💡 Passo 2 — Eliminação das Alternativas Incorretas",
                "content": "A) Errada: durou mais de 3 séculos, não apenas o XVII. B) Errada: os escravizados resistiram ativamente. D) Errada: quilombos eram formados por escravizados fugidos, não por colonos portugueses. E) Errada: a resistência incluiu preservação cultural e religiosa, não só revoltas armadas."
            },
            {
                "title": "🛠️ Passo 3 — Resposta Correta",
                "content": "A alternativa correta é: 'O Brasil foi o maior importador de africanos escravizados das Américas, e os escravizados resistiram à opressão de diversas formas, incluindo a formação de quilombos.'"
            }
        ]
    },
    {
        "questionId": 35,
        "steps": [
            {
                "title": "🔍 Passo 1 — Aspectos Positivos da Globalização no Texto",
                "content": "O texto menciona como pontos positivos: integração econômica, política, cultural e tecnológica; circulação mais rápida de produtos, capitais, informações e pessoas entre as nações."
            },
            {
                "title": "💡 Passo 2 — Aspectos Negativos da Globalização no Texto",
                "content": "O texto menciona como críticas: ampliação das desigualdades entre países ricos e pobres; ameaça às culturas locais pela homogeneização cultural; intensificação da exploração de recursos naturais nos países em desenvolvimento."
            },
            {
                "title": "🛠️ Passo 3 — Resposta Correta",
                "content": "A alternativa correta é: 'promove integração entre os países e facilita a circulação de produtos e informações, mas também pode ampliar desigualdades e ameaçar culturas locais.' — síntese dos dois aspectos presentes no texto."
            }
        ]
    },
    {
        "questionId": 36,
        "steps": [
            {
                "title": "🔍 Passo 1 — Leitura da Situação",
                "content": "A tirinha apresenta um personagem que encontra um ovo de dinossauro, assiste ao nascimento do filhote e se despede. No último quadro, há uma virada: ao ver o filhote, o personagem pensa em como usá-lo."
            },
            {
                "title": "💡 Passo 2 — Mecanismo do Humor",
                "content": "O humor surge do contraste entre o inusitado da situação (ovo de dinossauro eclodindo) e a reação completamente mundana e oportunista do personagem: em vez de susto ou admiração, ele pensa imediatamente em como usar o filhote para assustar 'a Thuga'."
            },
            {
                "title": "🛠️ Passo 3 — Resposta Correta",
                "content": "A alternativa correta é: 'o personagem percebe que o filhote de dinossauro pode ser usado para assustar alguém chamado Thuga, transformando uma situação inesperada em uma oportunidade cômica e pessoal.'"
            }
        ]
    },
    {
        "questionId": 37,
        "steps": [
            {
                "title": "🔍 Passo 1 — Dados Científicos do Texto",
                "content": "Dinossauros não-avianos: extintos há ~66 milhões de anos (fim do Cretáceo). Primeiros hominídeos (gênero Homo): surgiram há ~2 a 3 milhões de anos. Diferença temporal: mais de 60 milhões de anos."
            },
            {
                "title": "💡 Passo 2 — Natureza da Tirinha",
                "content": "A coexistência entre humanos e dinossauros na tirinha do Piteco é um recurso de FICÇÃO e HUMOR, sem qualquer base científica. O próprio texto reconhece isso ao afirmar que essa situação 'sempre foi um elemento de fantasia e humor'."
            },
            {
                "title": "🛠️ Passo 3 — Resposta Correta",
                "content": "A alternativa correta é: 'A convivência entre humanos e dinossauros na tirinha é um recurso de ficção e humor, pois cientificamente há uma diferença de dezenas de milhões de anos entre a extinção dos dinossauros e o surgimento dos hominídeos.'"
            }
        ]
    },
    {
        "questionId": 38,
        "steps": [
            {
                "title": "🔍 Passo 1 — Cálculo dos Alunos de Informática e Administração",
                "content": "Total da turma: 80 alunos. Informática: 2/5 × 80 = 32 alunos. Administração: 1/4 × 80 = 20 alunos."
            },
            {
                "title": "💡 Passo 2 — Soma dos Alunos já Distribuídos",
                "content": "Total em Informática e Administração: 32 + 20 = 52 alunos."
            },
            {
                "title": "🛠️ Passo 3 — Cálculo dos Alunos de Enfermagem",
                "content": "Alunos de Enfermagem (restante): 80 − 52 = 28 alunos. Verificação: 32/80 + 20/80 + 28/80 = 80/80 = 1 (total da turma) ✓."
            }
        ]
    },
    {
        "questionId": 39,
        "steps": [
            {
                "title": "🔍 Passo 1 — Funções de Cada Órgão Segundo o Texto",
                "content": "Boca: tritura alimentos e saliva inicia quebra do amido. Esôfago: conduz o alimento ao estômago. Estômago: suco gástrico digere proteínas. Intestino delgado: digestão química e absorção de nutrientes. Intestino grosso: absorve água e sais minerais. Ânus: eliminação das fezes."
            },
            {
                "title": "💡 Passo 2 — Análise das Alternativas Incorretas",
                "content": "A) Errada: absorção de nutrientes é função do intestino DELGADO, não do estômago. B) Errada: o suco gástrico é produzido pelo ESTÔMAGO, não pelo esôfago. D) Errada: digestão química completa é do intestino delgado, não do grosso. E) Errada: o ânus não produz enzimas digestivas."
            },
            {
                "title": "🛠️ Passo 3 — Resposta Correta",
                "content": "A alternativa correta é: 'A boca inicia o processo digestivo por meio da trituração dos alimentos pelos dentes e da ação da saliva sobre o amido.' — informação diretamente confirmada no texto."
            }
        ]
    },
    {
        "questionId": 40,
        "steps": [
            {
                "title": "🔍 Passo 1 — Análise das Afirmações I e II",
                "content": "Afirmação I: 'A imagem é REAL...' → INCORRETA. O texto afirma que a imagem é VIRTUAL ('formada atrás do espelho, onde a luz não passa de fato'). Imagens virtuais não podem ser projetadas em anteparos. Afirmação II: 'A imagem tem o mesmo tamanho que o objeto e está à mesma distância do espelho.' → CORRETA (confirmada no texto)."
            },
            {
                "title": "💡 Passo 2 — Análise das Afirmações III e IV",
                "content": "Afirmação III: 'A imagem é direita e apresenta inversão lateral.' → CORRETA (o texto confirma ambos). Afirmação IV: 'Se o objeto está a 30 cm do espelho, sua imagem estará a 60 cm do objeto.' → CORRETA: a imagem está a 30 cm atrás do espelho, portanto a distância total objeto-imagem = 30 + 30 = 60 cm."
            },
            {
                "title": "🛠️ Passo 3 — Resposta Final",
                "content": "Estão corretas apenas as afirmações II, III e IV."
            }
        ]
    }
]